app/controllers/books_controller.rb

  def index
    @books = Book.all  # Fetch books from the database
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "description", "created_at", "updated_at") VALUES ('test ', 'test ', NULL, '2024-12-29 22:32:58.214877', '2024-12-29 22:32:58.214877') RETURNING "id"

  def set_book
    @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1